koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/I2C_STM32F7xx.c
/*
 * Copyright (C) 2019 Sergey Koshkin <koshkin.sergey@gmail.com>
 * All rights reserved
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * Project: I2C Driver for STMicroelectronics STM32F7xx
 */

/*******************************************************************************
 *  includes
 ******************************************************************************/

#include <string.h>
#include "I2C_STM32F7xx.h"

#if defined(USE_I2C1) || defined(USE_I2C2) || defined(USE_I2C3) || \
    defined(USE_I2C4)

/*******************************************************************************
 *  external declarations
 ******************************************************************************/

/*******************************************************************************
 *  defines and macros (scope: module-local)
 ******************************************************************************/

#define T_I2CCLK                    125UL // tI2CCLK    =  125 ns
#define STD_MODE_SCLL               40UL  // 40*tI2CCLK = 5000 ns
#define STD_MODE_SCLH               32UL  // 32*tI2CCLK = 4000 ns
#define STD_MODE_SDADEL             4UL   // 4*tI2CCLK  =  500 ns
#define STD_MODE_SCLDEL             10UL  // 10*tI2CCLK = 1250 ns
#define FST_MODE_SCLL               10UL  // 10*tI2CCLK = 1250 ns
#define FST_MODE_SCLH               4UL   // 4*tI2CCLK  =  500 ns
#define FST_MODE_SDADEL             1UL   // 1*tI2CCLK  =  125 ns
#define FST_MODE_SCLDEL             4UL   // 4*tI2CCLK  =  500 ns
#define FSTP_MODE_SCLL              2UL  //  2*tI2CCLK  =  250 ns
#define FSTP_MODE_SCLH              2UL   // 2*tI2CCLK  =  250 ns
#define FSTP_MODE_SDADEL            0UL   // 0*tI2CCLK  =    0 ns
#define FSTP_MODE_SCLDEL            2UL   // 2*tI2CCLK  =  250 ns


#define I2C_DRV_VERSION DRIVER_VERSION_MAJOR_MINOR(1,0) /* driver version */

/*******************************************************************************
 *  typedefs and structures (scope: module-local)
 ******************************************************************************/

/*******************************************************************************
 *  function prototypes (scope: module-local)
 ******************************************************************************/

#ifdef I2C_DMA_TX
static void I2Cx_TX_DMA_Callback(uint32_t event, const void *param);
#endif

#ifdef I2C_DMA_RX
static void I2Cx_RX_DMA_Callback(uint32_t event, const void *param);
#endif

/*******************************************************************************
 *  global variable definitions (scope: module-local)
 ******************************************************************************/

/* Driver Version */
static const DRIVER_VERSION DriverVersion = {
  I2C_API_VERSION,
  I2C_DRV_VERSION
};

/* Driver Capabilities */
static const I2C_CAPABILITIES DriverCapabilities = {
  1,           /* supports 10-bit addressing */
};

static const GPIO_PIN_CFG_t I2C_pin_cfg_af = {
    GPIO_MODE_AF_OD, GPIO_PULL_DISABLE, GPIO_SPEED_HIGH
};

static const GPIO_PIN_CFG_t I2C_pin_cfg_analog = {
    GPIO_MODE_ANALOG, GPIO_PULL_DISABLE, GPIO_SPEED_LOW
};

#if defined(USE_I2C1)
/* I2C1 Information (Run-Time) */
static I2C_INFO      I2C1_Info;
static I2C_RESOURCES I2C1_Resources;

static I2C_PIN I2C1_scl = {
    I2C1_SCL_GPIO_PORT, I2C1_SCL_GPIO_PIN, I2C1_SCL_GPIO_FUNC
};
static I2C_PIN I2C1_sda = {
    I2C1_SDA_GPIO_PORT, I2C1_SDA_GPIO_PIN, I2C1_SDA_GPIO_FUNC
};

#ifdef I2C1_TX_DMA_Stream
static DMA_Handle_t I2C1_TX_DMA_Handle;
static const DMA_Resources_t I2C1_TX_DMA = {
  &I2C1_TX_DMA_Handle,
  I2C1_TX_DMA_Stream,
  I2C1_TX_DMA_Channel,
  I2C1_TX_DMA_Priority,
  I2Cx_TX_DMA_Callback,
  &I2C1_Resources,
  DEV_I2C_DMA_INT_PRIORITY,
  I2C1_TX_DMA_IRQn,
};
#endif

#ifdef I2C1_RX_DMA_Stream
static DMA_Handle_t I2C1_RX_DMA_Handle;
static const DMA_Resources_t I2C1_RX_DMA = {
  &I2C1_RX_DMA_Handle,
  I2C1_RX_DMA_Stream,
  I2C1_RX_DMA_Channel,
  I2C1_RX_DMA_Priority,
  I2Cx_RX_DMA_Callback,
  &I2C1_Resources,
  DEV_I2C_DMA_INT_PRIORITY,
  I2C1_RX_DMA_IRQn,
};
#endif

/* I2C1 Resources */
static I2C_RESOURCES I2C1_Resources = {
  I2C1,
#ifdef I2C1_RX_DMA_Stream
  &I2C1_RX_DMA,
#else
  NULL,
#endif
#ifdef I2C1_TX_DMA_Stream
  &I2C1_TX_DMA,
#else
  NULL,
#endif
  {
      &I2C1_scl,
      &I2C1_sda,
  },
  RCC_PERIPH_I2C1,
  &I2C1_Info,
  I2C1_EV_IRQn,
  I2C1_ER_IRQn,
};
#endif /* USE_I2C1 */

#if defined(USE_I2C2)
/* I2C2 Information (Run-Time) */
static I2C_INFO      I2C2_Info;
static I2C_RESOURCES I2C2_Resources;

static I2C_PIN I2C2_scl = {
    I2C2_SCL_GPIO_PORT, I2C2_SCL_GPIO_PIN, I2C2_SCL_GPIO_FUNC
};
static I2C_PIN I2C2_sda = {
    I2C2_SDA_GPIO_PORT, I2C2_SDA_GPIO_PIN, I2C2_SDA_GPIO_FUNC
};

#ifdef I2C2_TX_DMA_Stream
static DMA_Handle_t I2C2_TX_DMA_Handle;
static const DMA_Resources_t I2C2_TX_DMA = {
  &I2C2_TX_DMA_Handle,
  I2C2_TX_DMA_Stream,
  I2C2_TX_DMA_Channel,
  I2C2_TX_DMA_Priority,
  I2Cx_TX_DMA_Callback,
  &I2C2_Resources,
  DEV_I2C_DMA_INT_PRIORITY,
  I2C2_TX_DMA_IRQn,
};
#endif

#ifdef I2C2_RX_DMA_Stream
static DMA_Handle_t I2C2_RX_DMA_Handle;
static const DMA_Resources_t I2C2_RX_DMA = {
  &I2C2_RX_DMA_Handle,
  I2C2_RX_DMA_Stream,
  I2C2_RX_DMA_Channel,
  I2C2_RX_DMA_Priority,
  I2Cx_RX_DMA_Callback,
  &I2C2_Resources,
  DEV_I2C_DMA_INT_PRIORITY,
  I2C2_RX_DMA_IRQn,
};
#endif

/* I2C2 Resources */
static I2C_RESOURCES I2C2_Resources = {
  I2C2,
#ifdef I2C2_RX_DMA_Stream
  &I2C2_RX_DMA,
#else
  NULL,
#endif
#ifdef I2C2_TX_DMA_Stream
  &I2C2_TX_DMA,
#else
  NULL,
#endif
  {
      &I2C2_scl,
      &I2C2_sda,
  },
  RCC_PERIPH_I2C2,
  &I2C2_Info,
  I2C2_EV_IRQn,
  I2C2_ER_IRQn,
};
