koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/I2C_STM32F7xx.c
#endif /* USE_I2C2 */

#if defined(USE_I2C3)
/* I2C3 Information (Run-Time) */
static I2C_INFO      I2C3_Info;
static I2C_RESOURCES I2C3_Resources;

static I2C_PIN I2C3_scl = {
    I2C3_SCL_GPIO_PORT, I2C3_SCL_GPIO_PIN, I2C3_SCL_GPIO_FUNC
};
static I2C_PIN I2C3_sda = {
    I2C3_SDA_GPIO_PORT, I2C3_SDA_GPIO_PIN, I2C3_SDA_GPIO_FUNC
};

#ifdef I2C3_TX_DMA_Stream
static DMA_Handle_t I2C3_TX_DMA_Handle;
static const DMA_Resources_t I2C3_TX_DMA = {
  &I2C3_TX_DMA_Handle,
  I2C3_TX_DMA_Stream,
  I2C3_TX_DMA_Channel,
  I2C3_TX_DMA_Priority,
  I2Cx_TX_DMA_Callback,
  &I2C3_Resources,
  DEV_I2C_DMA_INT_PRIORITY,
  I2C3_TX_DMA_IRQn,
};
#endif

#ifdef I2C3_RX_DMA_Stream
static DMA_Handle_t I2C3_RX_DMA_Handle;
static const DMA_Resources_t I2C3_RX_DMA = {
  &I2C3_RX_DMA_Handle,
  I2C3_RX_DMA_Stream,
  I2C3_RX_DMA_Channel,
  I2C3_RX_DMA_Priority,
  I2Cx_RX_DMA_Callback,
  &I2C3_Resources,
  DEV_I2C_DMA_INT_PRIORITY,
  I2C3_RX_DMA_IRQn,
};
#endif

/* I2C3 Resources */
static I2C_RESOURCES I2C3_Resources = {
  I2C3,
#ifdef I2C3_RX_DMA_Stream
  &I2C3_RX_DMA,
#else
  NULL,
#endif
#ifdef I2C3_TX_DMA_Stream
  &I2C3_TX_DMA,
#else
  NULL,
#endif
  {
      &I2C3_scl,
      &I2C3_sda,
  },
  RCC_PERIPH_I2C3,
  &I2C3_Info,
  I2C3_EV_IRQn,
  I2C3_ER_IRQn,
};
#endif /* USE_I2C3 */

#if defined(USE_I2C4)
/* I2C4 Information (Run-Time) */
static I2C_INFO      I2C4_Info;
static I2C_RESOURCES I2C4_Resources;

static I2C_PIN I2C4_scl = {
    I2C4_SCL_GPIO_PORT, I2C4_SCL_GPIO_PIN, I2C4_SCL_GPIO_FUNC
};
static I2C_PIN I2C4_sda = {
    I2C4_SDA_GPIO_PORT, I2C4_SDA_GPIO_PIN, I2C4_SDA_GPIO_FUNC
};

#ifdef I2C4_TX_DMA_Stream
static DMA_Handle_t I2C4_TX_DMA_Handle;
static const DMA_Resources_t I2C4_TX_DMA = {
  &I2C4_TX_DMA_Handle,
  I2C4_TX_DMA_Stream,
  I2C4_TX_DMA_Channel,
  I2C4_TX_DMA_Priority,
  I2Cx_TX_DMA_Callback,
  &I2C4_Resources,
  DEV_I2C_DMA_INT_PRIORITY,
  I2C4_TX_DMA_IRQn,
};
#endif

#ifdef I2C4_RX_DMA_Stream
static DMA_Handle_t I2C4_RX_DMA_Handle;
static const DMA_Resources_t I2C4_RX_DMA = {
  &I2C4_RX_DMA_Handle,
  I2C4_RX_DMA_Stream,
  I2C4_RX_DMA_Channel,
  I2C4_RX_DMA_Priority,
  I2Cx_RX_DMA_Callback,
  &I2C4_Resources,
  DEV_I2C_DMA_INT_PRIORITY,
  I2C4_RX_DMA_IRQn,
};
#endif

/* I2C4 Resources */
static I2C_RESOURCES I2C4_Resources = {
  I2C4,
#ifdef I2C4_RX_DMA_Stream
  &I2C4_RX_DMA,
#else
  NULL,
#endif
#ifdef I2C4_TX_DMA_Stream
  &I2C4_TX_DMA,
#else
  NULL,
#endif
  {
      &I2C4_scl,
      &I2C4_sda,
  },
  RCC_PERIPH_I2C4,
  &I2C4_Info,
  I2C4_EV_IRQn,
  I2C4_ER_IRQn,
};
#endif /* USE_I2C4 */

/*******************************************************************************
 *  function implementations (scope: module-local)
 ******************************************************************************/

/**
 * @fn          void PinConfig(const I2C_PIN *io, const GPIO_PIN_CFG_t *pin_cfg)
 * @brief       Configure Pin
 * @param[in]   io       Pointer to I2C_PIN
 * @param[in]   pin_cfg  Pointer to GPIO_PIN_CFG_t
 */
static
void PinConfig(const I2C_PIN *io, const GPIO_PIN_CFG_t *pin_cfg)
{
  if ((io == NULL) || (pin_cfg == NULL))
    return;

  if (GPIO_GetPortClockState(io->port) == false)
    GPIO_PortClock(io->port, GPIO_PORT_CLK_ENABLE);

  if (pin_cfg->mode == GPIO_MODE_AF_PP || pin_cfg->mode == GPIO_MODE_AF_OD)
    GPIO_AFConfig(io->port, io->pin, io->func);

  GPIO_PinConfig(io->port, io->pin, pin_cfg);
}

/**
 * @fn      DRIVER_VERSION I2C_GetVersion(void)
 * @brief   Get driver version.
 * @return  \ref DRIVER_VERSION
 */
static
DRIVER_VERSION I2Cx_GetVersion(void)
{
  return (DriverVersion);
}

/**
 * @fn      I2C_CAPABILITIES I2C_GetCapabilities(void)
 * @brief   Get driver capabilities.
 * @return  \ref I2C_CAPABILITIES
 */
static
I2C_CAPABILITIES I2Cx_GetCapabilities(void)
{
  return (DriverCapabilities);
}

/**
 * @fn          int32_t I2C_Initialize(I2C_SignalEvent_t cb_event, I2C_RESOURCES *i2c)
 * @brief       Initialize I2C Interface.
 * @param[in]   cb_event  Pointer to \ref I2C_SignalEvent
 * @param[in]   i2c   Pointer to I2C resources
 * @return      \ref execution_status
 */
static
int32_t I2C_Initialize(I2C_SignalEvent_t cb_event, I2C_RESOURCES *i2c)
{
  I2C_IO *io = &i2c->io;
  I2C_INFO *info = i2c->info;

  if (info->flags & I2C_INIT) {
    return (DRIVER_OK);
  }

  /* Configure SCL Pin */
  PinConfig(io->scl, &I2C_pin_cfg_af);
  /* Configure SDA Pin */
  PinConfig(io->sda, &I2C_pin_cfg_af);

  /* Initialize DMA */
#ifdef I2C_DMA_TX
  if (i2c->dma_tx != NULL) {
    DMA_StreamConfig_t *cfg = &i2c->dma_tx->handle->config;

    cfg->Direction    = DMA_DIR_MEM_TO_PER;
    cfg->PerInc       = DMA_PINC_DISABLE;
    cfg->MemInc       = DMA_MINC_ENABLE;
    cfg->PerDataAlign = DMA_PDATAALIGN_BYTE;
    cfg->MemDataAlign = DMA_MDATAALIGN_BYTE;
    cfg->Mode         = DMA_MODE_NORMAL;
    cfg->FIFOMode     = DMA_FIFOMODE_DISABLE;
    cfg->MemBurst     = DMA_MBURST_SINGLE;
    cfg->PerBurst     = DMA_PBURST_SINGLE;

    DMA_Initialize(i2c->dma_tx);
  }
#endif

#ifdef I2C_DMA_RX
  if (i2c->dma_rx != NULL) {
    DMA_StreamConfig_t *cfg = &i2c->dma_rx->handle->config;

    cfg->Direction    = DMA_DIR_PER_TO_MEM;
    cfg->PerInc       = DMA_PINC_DISABLE;
    cfg->MemInc       = DMA_MINC_ENABLE;
    cfg->PerDataAlign = DMA_PDATAALIGN_BYTE;
    cfg->MemDataAlign = DMA_MDATAALIGN_BYTE;
    cfg->Mode         = DMA_MODE_NORMAL;
    cfg->FIFOMode     = DMA_FIFOMODE_DISABLE;
    cfg->MemBurst     = DMA_MBURST_SINGLE;
    cfg->PerBurst     = DMA_PBURST_SINGLE;

    DMA_Initialize(i2c->dma_rx);
  }
#endif

  /* Reset Run-Time information structure */
  memset(info, 0x00, sizeof(I2C_INFO));

  info->cb_event = cb_event;
  info->flags    = I2C_INIT;

  return (DRIVER_OK);
}

/**
 * @fn          int32_t I2C_Uninitialize(I2C_RESOURCES *i2c)
 * @brief       De-initialize I2C Interface.
 * @param[in]   i2c   Pointer to I2C resources
 * @return      \ref execution_status
 */
static
int32_t I2C_Uninitialize(I2C_RESOURCES *i2c)
{
  I2C_IO *io = &i2c->io;

  /* Unconfigure SCL Pin */
  PinConfig(io->scl, &I2C_pin_cfg_analog);
  /* Unconfigure SDA Pin */
  PinConfig(io->sda, &I2C_pin_cfg_analog);

