koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/I2C_STM32F7xx.c
  i2c->info->flags = 0U;

  return (DRIVER_OK);
}

/**
 * @fn          int32_t I2C_PowerControl(POWER_STATE state, I2C_RESOURCES *i2c)
 * @brief       Control I2C Interface Power.
 * @param[in]   state   Power state
 * @param[in]   i2c     Pointer to I2C resources
 * @return      \ref execution_status
 */
static
int32_t I2C_PowerControl(POWER_STATE state, I2C_RESOURCES *i2c)
{
  uint32_t cr1;
  I2C_INFO *info = i2c->info;
  I2C_TypeDef *reg = i2c->reg;

  switch (state) {
    case POWER_OFF:
      /* Enable I2C clock */
      RCC_EnablePeriph(i2c->rcc);

      /* Disable I2C peripheral */
      reg->CR1 = 0;

      /* Disable I2C IRQ */
      NVIC_DisableIRQ(i2c->ev_irq_num);
      NVIC_DisableIRQ(i2c->er_irq_num);

      /* Abort DMA streams */
#ifdef I2C_DMA_TX
      if (i2c->dma_tx != NULL) {
        DMA_Abort(i2c->dma_tx);
        DMA_WaitAbort(i2c->dma_tx);
        DMA_Uninitialize(i2c->dma_tx);
      }
#endif

#ifdef I2C_DMA_RX
      if (i2c->dma_rx != NULL) {
        DMA_Abort(i2c->dma_rx);
        DMA_WaitAbort(i2c->dma_rx);
        DMA_Uninitialize(i2c->dma_rx);
      }
#endif

      /* Disable peripheral clock */
      RCC_DisablePeriph(i2c->rcc);

      info->status.busy             = 0U;
      info->status.mode             = 0U;
      info->status.direction        = 0U;
      info->status.general_call     = 0U;
      info->status.arbitration_lost = 0U;
      info->status.bus_error        = 0U;

      info->flags &= ~I2C_POWER;
      break;

    case POWER_FULL:
      if ((info->flags & I2C_INIT) == 0U) {
        return (DRIVER_ERROR);
      }

      if ((info->flags & I2C_POWER) != 0U) {
        return (DRIVER_OK);
      }

      /* Enable I2C clock */
      RCC_EnablePeriph(i2c->rcc);

      /* Clear and Enable I2C IRQ */
      NVIC_ClearPendingIRQ(i2c->ev_irq_num);
      NVIC_ClearPendingIRQ(i2c->er_irq_num);
      NVIC_SetPriority(i2c->ev_irq_num, DEV_I2C_INT_PRIORITY);
      NVIC_SetPriority(i2c->er_irq_num, DEV_I2C_INT_PRIORITY);
      NVIC_EnableIRQ(i2c->ev_irq_num);
      NVIC_EnableIRQ(i2c->er_irq_num);

      /* Reset the peripheral */
      RCC_ResetPeriph(i2c->rcc);

      /* Initial peripheral setup */
      cr1 = I2C_CR1_SBC    | /* Slave byte control enabled          */
            I2C_CR1_ERRIE  | /* Error interrupts enabled            */
            I2C_CR1_TCIE   | /* Transfer complete interrupt enabled */
            I2C_CR1_STOPIE | /* STOP detection interrupt enabled    */
            I2C_CR1_NACKIE | /* NACK interrupt enabled              */
            I2C_CR1_ADDRIE ; /* Address match interrupt enabled     */

      /* Enable IRQ/DMA rx/tx requests */
#ifdef I2C_DMA_RX
      if (i2c->dma_rx == NULL) {
        DMA_Config(i2c->dma_rx);
        cr1 |= I2C_CR1_RXDMAEN;
      }
      else
#endif
      {
        cr1 |= I2C_CR1_RXIE;
      }

#ifdef I2C_DMA_TX
      if (i2c->dma_tx != NULL) {
        DMA_Config(i2c->dma_tx);
        cr1 |= I2C_CR1_TXDMAEN;
      }
      else
#endif
      {
        cr1 |= I2C_CR1_TXIE;
      }

      /* Apply setup and enable peripheral */
      reg->CR1 = cr1 | I2C_CR1_PE;

      /* Ready for operation */
      info->flags |= I2C_POWER;
      break;

    default:
      return (DRIVER_ERROR_UNSUPPORTED);
  }

  return (DRIVER_OK);
}

/**
 * @fn          int32_t I2C_MasterTransmit(uint32_t addr,
 *                                         const uint8_t *data,
 *                                         uint32_t num,
 *                                         bool xfer_pending,
 *                                         I2C_RESOURCES *i2c)
 * @brief       Start transmitting data as I2C Master.
 * @param[in]   addr          Slave address (7-bit or 10-bit)
 * @param[in]   data          Pointer to buffer with data to transmit to I2C Slave
 * @param[in]   num           Number of data bytes to transmit
 * @param[in]   xfer_pending  Transfer operation is pending - Stop condition will not be generated
 * @param[in]   i2c           Pointer to I2C resources
 * @return      \ref execution_status
 */
static
int32_t I2C_MasterTransmit(uint32_t addr, const uint8_t *data, uint32_t num,
    bool xfer_pending, I2C_RESOURCES *i2c)
{
  uint32_t cr2, cnt;
  bool restart;
  I2C_INFO *info = i2c->info;
  I2C_TypeDef *i2c_reg = i2c->reg;

  if ((data == NULL) || (num == 0U)) {
    return (DRIVER_ERROR_PARAMETER);
  }

  if ((addr & ~((uint32_t)I2C_ADDRESS_10BIT | (uint32_t)I2C_ADDRESS_GC)) > 0x3FFU) {
    return (DRIVER_ERROR_PARAMETER);
  }

  if (!(info->flags & I2C_SETUP)) {
    /* Driver not yet configured */
    return (DRIVER_ERROR);
  }

  if (info->status.busy) {
    return (DRIVER_ERROR_BUSY);
  }

  restart = (info->xfer.ctrl & XFER_CTRL_RESTART) != 0U;

  if (!restart) {
    /* New transfer */
    while (i2c_reg->ISR & I2C_ISR_BUSY) {
      __NOP(); /* Wait until bus released */
    }
  }

  info->status.busy             = 1U;
  info->status.mode             = 1U;
  info->status.direction        = 0U;
  info->status.bus_error        = 0U;
  info->status.arbitration_lost = 0U;

  info->xfer.num  = num;
  info->xfer.cnt  = 0;
  info->xfer.data = (uint8_t *)data;
  info->xfer.ctrl = 0U;

  if (xfer_pending) {
    info->xfer.ctrl = XFER_CTRL_RESTART;
  }

  /* Set slave address and transfer direction */
  if (addr & I2C_ADDRESS_10BIT) {
    cr2 = (addr & 0x3FF) | I2C_CR2_ADD10;
  }
  else {
    cr2 = (addr & 0x7F) << 1;
  }

  /* Set number of bytes to transfer */
  if (num < 256) {
    cnt = num;
    /* Send all data bytes and enable automatic STOP */
    if (!xfer_pending && !restart) {
      cr2 |= I2C_CR2_AUTOEND;
    }
  }
  else {
    cnt = 255;
    /* Send 255 data bytes and enable NBYTES reload */
    cr2 |= I2C_CR2_RELOAD;
  }

  /* Apply transfer setup */
  i2c_reg->CR2 = (cnt << I2C_CR2_NBYTES_Pos) | cr2;

#ifdef I2C_DMA_TX
  if (i2c->dma_tx) {
    /* Enable stream */
    DMA_Start(i2c->dma_tx, (uint32_t)&(i2c_reg->TXDR), (uint32_t)data, num);
  }
#endif

  /* Generate start */
  i2c_reg->CR2 |= I2C_CR2_START;
  /* Enable transfer complete interrupt */
  i2c_reg->CR1 |= I2C_CR1_TCIE;

  return (DRIVER_OK);
}

/**
 * @fn                        int32_t I2C_MasterReceive(uint32_t addr,
 *                                                      uint8_t *data,
 *                                                      uint32_t num,
 *                                                      bool xfer_pending,
 *                                                      I2C_RESOURCES *i2c)
 * @brief                     Start receiving data as I2C Master.
 * @param[in]   addr          Slave address (7-bit or 10-bit)
 * @param[out]  data          Pointer to buffer for data to receive from I2C Slave
 * @param[in]   num           Number of data bytes to receive
 * @param[in]   xfer_pending  Transfer operation is pending - Stop condition will not be generated
 * @param[in]   i2c           Pointer to I2C resources
 * @return                    \ref execution_status
 */
static
int32_t I2C_MasterReceive(uint32_t addr, uint8_t *data, uint32_t num,
    bool xfer_pending, I2C_RESOURCES *i2c)
{
  uint32_t cr2, cnt;
  bool restart;
  I2C_INFO *info = i2c->info;
  I2C_TypeDef *i2c_reg = i2c->reg;

