koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/I2C_STM32F7xx.c
  if ((data == NULL) || (num == 0U)) {
    return (DRIVER_ERROR_PARAMETER);
  }

  if ((addr & ~(I2C_ADDRESS_10BIT | I2C_ADDRESS_GC)) > 0x3FFU) {
    return (DRIVER_ERROR_PARAMETER);
  }

  if (!(info->flags & I2C_SETUP)) {
    /* Driver not yet configured */
    return (DRIVER_ERROR);
  }

  if (info->status.busy) {
    return (DRIVER_ERROR_BUSY);
  }

  restart = (info->xfer.ctrl & XFER_CTRL_RESTART) != 0U;

  if (!restart) {
    /* New transfer */
    while (i2c_reg->ISR & I2C_ISR_BUSY) {
      __NOP(); /* Wait until bus released */
    }
  }

  info->status.busy             = 1U;
  info->status.mode             = 1U;
  info->status.direction        = 1U;
  info->status.bus_error        = 0U;
  info->status.arbitration_lost = 0U;

  info->xfer.num  = num;
  info->xfer.cnt  = 0;
  info->xfer.data = (uint8_t *)data;
  info->xfer.ctrl = 0U;

  if (xfer_pending) {
    info->xfer.ctrl = XFER_CTRL_RESTART;
  }

  /* Set slave address and transfer direction */
  if ((addr & I2C_ADDRESS_10BIT) != 0) {
    cr2 = (addr & 0x3FF) | I2C_CR2_ADD10 | I2C_CR2_RD_WRN;
  }
  else {
    cr2 = ((addr & 0x7F) << 1) | I2C_CR2_RD_WRN;
  }

  /* Set number of bytes to transfer */
  if (num < 256) {
    cnt = num;
    /* Send all data bytes and enable automatic STOP */
    if (!xfer_pending && !restart) {
      cr2 |= I2C_CR2_AUTOEND;
    }
  }
  else {
    cnt = 255;
    /* Send 255 data bytes and enable NBYTES reload */
    cr2 |= I2C_CR2_RELOAD;
  }

  /* Apply transfer setup */
  i2c_reg->CR2 = (cnt << I2C_CR2_NBYTES_Pos) | cr2;

#ifdef I2C_DMA_RX
  if (i2c->dma_rx) {
    /* Enable stream */
    DMA_Start(i2c->dma_rx, (uint32_t)&(i2c_reg->RXDR), (uint32_t)data, num);
  }
#endif

  /* Generate start */
  i2c_reg->CR2 |= I2C_CR2_START;
  /* Enable transfer complete interrupt */
  i2c_reg->CR1 |= I2C_CR1_TCIE;

  return (DRIVER_OK);
}

/**
  \fn          int32_t I2Cx_SlaveTransmit (const uint8_t *data,
                                           uint32_t       num,
                                           I2C_RESOURCES *i2c)
  \brief       Start transmitting data as I2C Slave.
  \param[in]   data  Pointer to buffer with data to transmit to I2C Master
  \param[in]   num   Number of data bytes to transmit
  \param[in]   i2c   Pointer to I2C resources
  \return      \ref execution_status
*/
static
int32_t I2C_SlaveTransmit(const uint8_t *data, uint32_t num, I2C_RESOURCES *i2c)
{
  I2C_INFO *info = i2c->info;
  I2C_TypeDef *i2c_reg = i2c->reg;

  if ((data == NULL) || (num == 0U)) {
    return DRIVER_ERROR_PARAMETER;
  }

  if (info->status.busy) {
    return (DRIVER_ERROR_BUSY);
  }

  info->status.bus_error    = 0U;
  info->status.general_call = 0U;

  info->xfer.num  = num;
  info->xfer.cnt  = -1;
  info->xfer.data = (uint8_t *)data;
  info->xfer.ctrl = 0U;

  /* Set number of bytes to transfer */
  if (num < 256) {
    i2c_reg->CR2 = (num << I2C_CR2_NBYTES_Pos);
  }
  else {
    /* Send 255 data bytes and enable NBYTES reload */
    i2c_reg->CR2 = (255 << I2C_CR2_NBYTES_Pos) | I2C_CR2_RELOAD;
  }

#ifdef I2C_DMA_TX
  if (i2c->dma_tx) {
    /* Enable stream */
    DMA_Start(i2c->dma_tx, (uint32_t)&(i2c_reg->TXDR), (uint32_t)data, num);
  }
#endif

  return (DRIVER_OK);
}

/**
  \fn          int32_t I2Cx_SlaveReceive (uint8_t       *data,
                                          uint32_t       num,
                                          I2C_RESOURCES *i2c)
  \brief       Start receiving data as I2C Slave.
  \param[out]  data  Pointer to buffer for data to receive from I2C Master
  \param[in]   num   Number of data bytes to receive
  \param[in]   i2c   Pointer to I2C resources
  \return      \ref execution_status
*/
static
int32_t I2C_SlaveReceive(uint8_t *data, uint32_t num, I2C_RESOURCES *i2c)
{
  I2C_INFO *info = i2c->info;

  if ((data == NULL) || (num == 0U)) {
    return (DRIVER_ERROR_PARAMETER);
  }

  if (info->status.busy) {
    return (DRIVER_ERROR_BUSY);
  }

  info->status.bus_error    = 0U;
  info->status.general_call = 0U;

  info->xfer.num  = num;
  info->xfer.cnt  = -1;
  info->xfer.data = data;
  info->xfer.ctrl = 0U;

  /* Set number of bytes to transfer */
  i2c->reg->CR2 = (1 << I2C_CR2_NBYTES_Pos) | I2C_CR2_RELOAD; /* Send 1 byte and enable NBYTES reload */

  return (DRIVER_OK);
}

/**
 * @fn          int32_t I2C_GetDataCount(I2C_RESOURCES *i2c)
 * @brief       Get transferred data count.
 * @param[in]   i2c   Pointer to I2C resources
 * @return      Number of data bytes transferred;
 *              -1 when Slave is not addressed by Master
 */
static
int32_t I2C_GetDataCount(I2C_RESOURCES *i2c)
{
  return (i2c->info->xfer.cnt);
}

/**
 * @fn          int32_t I2C_Control(uint32_t control, uint32_t arg, I2C_RESOURCES *i2c)
 * @brief       Control I2C Interface.
 * @param[in]   control   Operation
 * @param[in]   arg   Argument of operation (optional)
 * @param[in]   i2c   Pointer to I2C resources
 * @return      \ref execution_status
 */
static
int32_t I2C_Control(uint32_t control, uint32_t arg, I2C_RESOURCES *i2c)
{
  I2C_INFO    *info = i2c->info;
  I2C_TypeDef *reg  = i2c->reg;
  uint32_t     val;

  if ((info->flags & I2C_POWER) == 0U) {
    /* I2C not powered */
    return DRIVER_ERROR;
  }

  switch (control) {
    case I2C_OWN_ADDRESS:
      if (arg == 0) {
        /* Disable slave */
        reg->OAR1 = 0;
      }
      else {
        if (arg & I2C_ADDRESS_GC) {
          /* Enable general call */
          reg->CR1 |=  I2C_CR1_GCEN;
        } else {
          /* Disable general call */
          reg->CR1 &= ~I2C_CR1_GCEN;
        }

        if (arg & I2C_ADDRESS_10BIT) {
          val = (arg & 0x3FF ) | I2C_OAR1_OA1MODE;
        } else {
          val = (arg & 0x7F) << 1;
        }

        reg->OAR1 = val | I2C_OAR1_OA1EN;
      }
      break;

    case I2C_BUS_SPEED:
    {
      uint32_t timing = 0;
      uint32_t i2cclk = RCC_GetPeriphFreq(i2c->rcc)/1000000;
      int32_t presc = ((T_I2CCLK * i2cclk / 1000) - 1);

      if (presc < 0) {
        return (DRIVER_ERROR_UNSUPPORTED);
      }

