koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/I2C_STM32F7xx.c
      switch (arg) {
        case I2C_BUS_SPEED_STANDARD:
          timing = ((presc << I2C_TIMINGR_PRESC_Pos)               |
                   ((STD_MODE_SCLDEL-1) << I2C_TIMINGR_SCLDEL_Pos) |
                   (STD_MODE_SDADEL << I2C_TIMINGR_SDADEL_Pos)     |
                   ((STD_MODE_SCLH-1) << I2C_TIMINGR_SCLH_Pos)     |
                   (STD_MODE_SCLL-1));
          break;

        case I2C_BUS_SPEED_FAST:
          timing = ((presc << I2C_TIMINGR_PRESC_Pos)               |
                   ((FST_MODE_SCLDEL-1) << I2C_TIMINGR_SCLDEL_Pos) |
                   (FST_MODE_SDADEL << I2C_TIMINGR_SDADEL_Pos)     |
                   ((FST_MODE_SCLH-1) << I2C_TIMINGR_SCLH_Pos)     |
                   (FST_MODE_SCLL-1));
          break;

        case I2C_BUS_SPEED_FAST_PLUS:
          timing = ((presc << I2C_TIMINGR_PRESC_Pos)               |
                   ((FSTP_MODE_SCLDEL-1) << I2C_TIMINGR_SCLDEL_Pos) |
                   (FSTP_MODE_SDADEL << I2C_TIMINGR_SDADEL_Pos)     |
                   ((FSTP_MODE_SCLH-1) << I2C_TIMINGR_SCLH_Pos)     |
                   (FSTP_MODE_SCLL-1));
          break;

        default:
          return DRIVER_ERROR_UNSUPPORTED;
      }

      reg->CR1 &= ~I2C_CR1_PE;
      reg->TIMINGR = timing;
      reg->CR1 |= I2C_CR1_PE;

      /* Master configured, clock set */
      info->flags |= I2C_SETUP;
    }
    break;

    case I2C_BUS_CLEAR:
      return DRIVER_ERROR_UNSUPPORTED;

    case I2C_ABORT_TRANSFER:
      /* Save CR1 register */
      val = reg->CR1;

      /* Disable DMA requests and peripheral interrupts */
      reg->CR1 &= ~(I2C_CR1_RXDMAEN |
                    I2C_CR1_TXDMAEN |
                    I2C_CR1_ERRIE   |
                    I2C_CR1_TCIE    |
                    I2C_CR1_STOPIE  |
                    I2C_CR1_NACKIE  |
                    I2C_CR1_ADDRIE  |
                    I2C_CR1_RXIE    |
                    I2C_CR1_TXIE)   ;

      if (info->status.mode != 0U) {
        /* Master generates stop after the current byte transfer */
        reg->CR2 |= I2C_CR2_STOP;
      }
      else {
        /* Slave receiver will send NACK */
        reg->CR2 |= I2C_CR2_NACK;
      }

#ifdef I2C_DMA_TX
      if (i2c->dma_tx != NULL) {
        DMA_Abort(i2c->dma_tx);
        DMA_WaitAbort(i2c->dma_tx);
      }
#endif

#ifdef I2C_DMA_RX
      if (i2c->dma_rx != NULL) {
        DMA_Abort(i2c->dma_rx);
        DMA_WaitAbort(i2c->dma_rx);
      }
#endif

      info->xfer.num                = 0U;
      info->xfer.cnt                = 0U;
      info->xfer.data               = NULL;
      info->xfer.ctrl               = 0U;

      info->status.busy             = 0U;
      info->status.mode             = 0U;
      info->status.direction        = 0U;
      info->status.general_call     = 0U;
      info->status.arbitration_lost = 0U;
      info->status.bus_error        = 0U;

      /* Disable peripheral (I2C lines will be released */
      reg->CR1 &= ~I2C_CR1_PE;

      /* Clear pending interrupts */
      reg->ICR = I2C_ICR_OVRCF  |
                 I2C_ICR_ARLOCF |
                 I2C_ICR_BERRCF |
                 I2C_ICR_STOPCF |
                 I2C_ICR_NACKCF |
                 I2C_ICR_ADDRCF ;

      /* Restore settings and enable peripheral */
      reg->CR1 = val;
      break;

    default:
      return (DRIVER_ERROR_UNSUPPORTED);
  }

  return (DRIVER_OK);
}

/**
 * @fn          I2C_STATUS I2C_GetStatus(I2C_RESOURCES *i2c)
 * @brief       Get I2C status.
 * @param[in]   i2c   Pointer to I2C resources
 * @return      I2C status \ref I2C_STATUS
 */
static
I2C_STATUS I2C_GetStatus(I2C_RESOURCES *i2c)
{
  return (i2c->info->status);
}

/**
 * @fn          void I2C_EV_IRQHandler(I2C_RESOURCES *i2c)
 * @brief       I2C Event Interrupt handler.
 * @param[in]   i2c   Pointer to I2C resources
 */
static
void I2C_EV_IRQHandler(I2C_RESOURCES *i2c)
{
  uint32_t           event = 0;
  I2C_TRANSFER_INFO *xfer = &i2c->info->xfer;
  I2C_INFO          *info = i2c->info;
  I2C_TypeDef       *reg = i2c->reg;
  uint32_t           isr = reg->ISR;

  if ((isr & I2C_ISR_RXNE) && (info->status.mode != 0U)) {
    /* Receive data register not empty */
    xfer->data[xfer->cnt++] = reg->RXDR;
    return;
  }
  else if (isr & I2C_ISR_TXIS) {
    /* Transmit data register empty */
    reg->TXDR = xfer->data[xfer->cnt++];
    return;
  }

  if (isr & (I2C_ISR_TC | I2C_ISR_TCR)) {
    if (isr & I2C_ISR_TC) {
      /* Transfer Complete */
      info->status.busy = 0U;

      if (xfer->ctrl & XFER_CTRL_RESTART) {
        /* Wait for pending transfer */
        reg->CR1 &= ~I2C_CR1_TCIE;

        event = I2C_EVENT_TRANSFER_DONE;
      }
      else {
        /* Send stop */
        reg->CR2 |= I2C_CR2_STOP;
      }
    }
    else {  // if (isr & I2C_ISR_TCR)
      /* Transfer Complete Reload */
      uint32_t cr = reg->CR2;

      cr &= ~(I2C_CR2_RELOAD | I2C_CR2_NBYTES);

      /* Slave receive mode */
      if ((info->status.direction == 1U) && (info->status.mode == 0)) {
        if (xfer->data != NULL) {
          if ((uint32_t)xfer->cnt < xfer->num) {
            xfer->data[xfer->cnt++] = (uint8_t)reg->RXDR;
            if ((uint32_t)xfer->cnt == xfer->num) {
              xfer->data = NULL;
            }
            cr |= (1 << I2C_CR2_NBYTES_Pos) | I2C_CR2_RELOAD;
          }
        }
        else {
          reg->RXDR;
          cr |= I2C_CR2_NACK;
          cr |= (1 << I2C_CR2_NBYTES_Pos) | I2C_CR2_RELOAD;
        }

        i2c->reg->CR2 = cr;
      }
      /* Other modes */
      else {
        uint32_t cnt = xfer->num - xfer->cnt;

        if (cnt < 256) {
          if ((xfer->ctrl & XFER_CTRL_RESTART) == 0) {
            cr |= I2C_CR2_AUTOEND;
          }
        }
        else {
          cnt = 255;
          cr |= I2C_CR2_RELOAD;
        }

        reg->CR2 = (cnt << I2C_CR2_NBYTES_Pos) | cr;
      }
    }
  }
  else if (isr & (I2C_ISR_STOPF | I2C_ISR_NACKF | I2C_ISR_ADDR)) {
    uint32_t icr = 0;

    if (isr & I2C_ISR_STOPF) {
      /* Stop detection flag */
      icr |= I2C_ICR_STOPCF;

      if (xfer->ctrl & XFER_CTRL_ADDR_NACK) {
        /* Slave address not acknowledged */
        event = I2C_EVENT_TRANSFER_DONE | I2C_EVENT_ADDRESS_NACK;
      }
      else {
        event = I2C_EVENT_TRANSFER_DONE;

