koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/I2C_STM32F7xx.c
        if (xfer->cnt < xfer->num) {
          event |= I2C_EVENT_TRANSFER_INCOMPLETE;
        }

        if (info->status.general_call) {
          event |= I2C_EVENT_GENERAL_CALL;
        }
      }

      xfer->data = NULL;
      xfer->ctrl = 0U;

      info->status.busy = 0U;
      info->status.mode = 0U;
    }
    else if (isr & I2C_ISR_ADDR) {
      /* Address matched (slave mode) */
      icr |= I2C_ICR_ADDRCF;

      info->status.mode = 0U;

      if ((isr & I2C_ISR_ADDCODE) == 0) {
        /* General call */
        info->status.general_call = 1U;

        event = I2C_EVENT_GENERAL_CALL;
      }

      /* Set transfer direction */
      if ((isr & I2C_ISR_DIR) == 0U) {
        info->status.direction = 1U; /* Slave enters receiver mode */

        event |= I2C_EVENT_SLAVE_RECEIVE;
      }
      else {
        info->status.direction = 0U; /* Slave enters transmitter mode */

        event |= I2C_EVENT_SLAVE_TRANSMIT;
      }

      if ((xfer->data == NULL) || (info->status.general_call != 0U)) {
        if (info->cb_event != NULL) {
          info->cb_event(event);
        }
        event = 0U;
      }

      info->status.busy  = 1U;
      xfer->cnt = 0;
      xfer->ctrl |= XFER_CTRL_ADDR_DONE;
    }
    else if (isr & I2C_ISR_NACKF) {
      /* NACK received */
      icr |= I2C_ICR_NACKCF;

      /* Master sends STOP after slave NACK */
      /* Slave already released the lines   */
      if (info->status.mode) {
        if (xfer->cnt == 0) {
          xfer->ctrl |= XFER_CTRL_ADDR_NACK;
        }
        else {
          xfer->cnt--;

          if ((isr & I2C_ISR_TXE) == 0U) {
            reg->ISR = I2C_ISR_TXE;
            xfer->cnt--;
          }
        }
      }
    }
    else if (isr & I2C_ISR_ARLO) {
      /* Arbitration lost */
      icr |= I2C_ICR_ARLOCF;

      /* Switch to slave mode */
      info->status.busy             = 0U;
      info->status.mode             = 0U;
      info->status.arbitration_lost = 1U;

      xfer->data = NULL;
      xfer->ctrl = 0U;

      event = I2C_EVENT_TRANSFER_DONE | I2C_EVENT_ARBITRATION_LOST;
    }
    else if (isr & I2C_ISR_BERR) {
      /* Bus error (misplaced start/stop) */
      icr |= I2C_ICR_BERRCF;

      info->status.bus_error = 1U;

      if (info->status.mode == 0U) {
        /* Lines are released in slave mode */
        info->status.busy = 0U;

        xfer->data = NULL;
        xfer->ctrl = 0U;
      }

      event = I2C_EVENT_TRANSFER_DONE | I2C_EVENT_BUS_ERROR;
    }

    /* Clear status flags */
    reg->ICR = icr;
  }

  /* Send events */
  if ((event) && (info->cb_event)) {
    info->cb_event(event);
  }
}

/**
 * @fn          void I2C_ER_IRQHandler(I2C_RESOURCES *i2c)
 * @brief       I2C Error Interrupt handler.
 * @param[in]   i2c   Pointer to I2C resources
 */
static
void I2C_ER_IRQHandler(I2C_RESOURCES *i2c)
{
  uint32_t           event = 0;
  I2C_TRANSFER_INFO *xfer = &i2c->info->xfer;
  I2C_INFO          *info = i2c->info;
  I2C_TypeDef       *reg = i2c->reg;
  uint32_t           isr = reg->ISR;
  uint32_t           icr = 0;

  if (isr & I2C_ISR_ARLO) {
    /* Arbitration lost */
    icr |= I2C_ICR_ARLOCF;

    /* Switch to slave mode */
    info->status.busy             = 0U;
    info->status.mode             = 0U;
    info->status.arbitration_lost = 1U;

    xfer->data = NULL;
    xfer->ctrl = 0U;

    event = I2C_EVENT_TRANSFER_DONE | I2C_EVENT_ARBITRATION_LOST;
  }
  else if (isr & I2C_ISR_BERR) {
    /* Bus error (misplaced start/stop) */
    icr |= I2C_ICR_BERRCF;

    info->status.bus_error = 1U;

    if (info->status.mode == 0U) {
      /* Lines are released in slave mode */
      info->status.busy = 0U;

      xfer->data = NULL;
      xfer->ctrl = 0U;
    }

    event = I2C_EVENT_TRANSFER_DONE | I2C_EVENT_BUS_ERROR;
  }

  /* Clear status flags */
  reg->ICR = icr;

  /* Send events */
  if ((event) && (info->cb_event)) {
    info->cb_event(event);
  }
}

#ifdef I2C_DMA_RX
static void I2Cx_RX_DMA_Callback(uint32_t event, const void *param)
{
  I2C_RESOURCES *i2c = param;

  if (event == DMA_EVENT_TRANSFER_COMPLETE) {
    i2c->info->xfer.cnt = (int32_t)(i2c->info->xfer.num - DMA_GET_COUNTER(i2c->dma_rx));
  }
}
#endif

#ifdef I2C_DMA_TX
static void I2Cx_TX_DMA_Callback(uint32_t event, const void *param)
{
  I2C_RESOURCES *i2c = param;

  if (event == DMA_EVENT_TRANSFER_COMPLETE) {
    i2c->info->xfer.cnt = (int32_t)(i2c->info->xfer.num - DMA_GET_COUNTER(i2c->dma_tx));
  }
}
#endif

/*******************************************************************************
 *  global variable definitions  (scope: module-exported)
 ******************************************************************************/

#if defined(USE_I2C1)
  I2Cx_EXPORT_DRIVER(1);
#endif  /* USE_I2C1 */

#if defined(USE_I2C2)
  I2Cx_EXPORT_DRIVER(2);
#endif  /* USE_I2C2 */

#if defined(USE_I2C3)
  I2Cx_EXPORT_DRIVER(3);
#endif  /* USE_I2C3 */

#if defined(USE_I2C4)
  I2Cx_EXPORT_DRIVER(4);
#endif  /* USE_I2C4 */

#endif /* defined(USE_I2C1) || defined(USE_I2C2) || defined(USE_I2C3) ...     */

/* ----------------------------- End of file ---------------------------------*/
